{"New Testament":[
  {
    "id": 1,
    "book": "New Testament",
    "name": "Light Shine",
    "reference": "Matthew 5:16",
    "passage": "Let your light so shine before men.",
    "fullPassage":"14 Ye are the light of the world. A city that is set on an hill cannot be hid. 15 Neither do men light a candle, and put it under a bushel, but on a candlestick; and it giveth light unto all that are in the house. 16 Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven."
    
  },
  {
    "id": 2,
    "book": "New Testament",
    "name": "Rest in Christ",
    "reference": "Matthew 11:28–30",
    "passage": "Come unto me, all ye that labour and are heavy laden, and I will give you rest.",
    "fullPassage":"28 ¶ Come unto me, all ye that labour and are heavy laden, and I will give you rest.29 Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. 30 For my yoke is easy, and my burden is light."
    
  },
  {
    "id": 3,
    "book": "New Testament",
    "name": "Keys of the Kingdom",
    "reference": "Matthew 16:15–19",
    "passage": "Jesus said, 'I will give unto thee the keys of the kingdom.'",
    "fullPassage":"15 He saith unto them, But whom say ye that I am? 16 And Simon Peter answered and said, Thou art the Christ, the Son of the living God. 17 And Jesus answered and said unto him, Blessed art thou, Simon Bar-jona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven. 18 And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. 19 And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven."
    
  },
  {
    "id": 4,
    "book": "New Testament",
    "name": "Love God and Neighbor",
    "reference": "Matthew 22:36–39",
    "passage": "Thou shalt love the Lord thy God. … Thou shalt love thy neighbour.",
    "fullPassage":"36 Master, which is the great commandment in the law? 37 Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind. 38 This is the first and great commandment. 39 And the second is like unto it, Thou shalt love thy neighbour as thyself."    
  },
  { 
    "id": 5,
    "book": "New Testament",
    "name": "Christ's Birth",
    "reference": "Luke 2:10–12",
    "passage": "For unto you is born this day in the city of David a Saviour, which is Christ the Lord.",
    "fullPassage":""
    
  },
  {
    "id": 6,
    "book": "New Testament",
    "name": "Sacrament Remembrance",
    "reference": "Luke 22:19–20",
    "passage": "Jesus Christ commanded, partake of the sacrament 'in remembrance of me.'",
    "fullPassage":"10 And the angel said unto them, Fear not: for, behold, I bring you good tidings of great joy, which shall be to all people.    11 For unto you is born this day in the city of David a Saviour, which is Christ the Lord.    12 And this shall be a sign unto you; Ye shall find the babe wrapped in swaddling clothes, lying in a manger."    
  },
  {
    "id": 7,
    "book": "New Testament",
    "name": "Christ's Resurrected Body",
    "reference": "Luke 24:36–39",
    "passage": "For a spirit hath not flesh and bones, as ye see me have.",
    "fullPassage":"19 ¶ And he took bread, and gave thanks, and brake it, and gave unto them, saying, This is my body which is given for you: this do in remembrance of me. 20 Likewise also the cup after supper, saying, This cup is the new testament in my blood, which is shed for you."
    
  },
  {
    "id": 8,
    "book": "New Testament",
    "name": "Born of Water and Spirit",
    "reference": "John 3:5",
    "passage": "Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God.",
    "fullPassage":"5 Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God."
    
  },
  {
    "id": 9,
    "book": "New Testament",
    "name": "God's Love",
    "reference": "John 3:16",
    "passage": "For God so loved the world, that he gave his only begotten Son.",
    "fullPassage":"16 ¶ For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life."
    
  },
  {
    "id": 10,
    "book": "New Testament",
    "name": "Knowing Doctrine",
    "reference": "John 7:17",
    "passage": "If any man will do his will, he shall know of the doctrine.",
    "fullPassage":"17 If any man will do his will, he shall know of the doctrine, whether it be of God, or whether I speak of myself."
    
  },
  {
    "id": 11,
    "book": "New Testament",
    "name": "Life Eternal",
    "reference": "John 17:3",
    "passage": "And this is life eternal, that they might know thee the only true God, and Jesus Christ.",
    "fullPassage":"3 And this is life eternal, that they might know thee the only true God, and Jesus Christ, whom thou hast sent."
    
  },
  {
    "id": 12,
    "book": "New Testament",
    "name": "Body as a Temple",
    "reference": "1 Corinthians 6:19–20",
    "passage": "Your body is the temple of the Holy Ghost.",
    "fullPassage":"19 What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own?    20 For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God’s."    
  },
  {
    "id": 13,
    "book": "New Testament",
    "name": "Man and Woman",
    "reference": "1 Corinthians 11:11",
    "passage": "Neither is the man without the woman, neither the woman without the man, in the Lord.",
    "fullPassage":"11 Nevertheless neither is the man without the woman, neither the woman without the man, in the Lord."
    
  },
  {
    "id": 14,
    "book": "New Testament",
    "name": "Resurrection",
    "reference": "1 Corinthians 15:20–22",
    "passage": "As in Adam all die, even so in Christ shall all be made alive.",
    "fullPassage":"20 But now is Christ risen from the dead, and become the firstfruits of them that slept.    21 For since by man came death, by man came also the resurrection of the dead.    22 For as in Adam all die, even so in Christ shall all be made alive."    
  },
  {
    "id": 15,
    "book": "New Testament",
    "name": "Degrees of Glory",
    "reference": "1 Corinthians 15:40–42",
    "passage": "In the Resurrection, there are three degrees of glory.",
    "fullPassage":"40 There are also celestial bodies, and bodies terrestrial: but the glory of the celestial is one, and the glory of the terrestrial is another.    41 There is one glory of the sun, and another glory of the moon, and another glory of the stars: for one star differeth from another star in glory.    42 So also is the resurrection of the dead. It is sown in corruption; it is raised in incorruption:" 
  },
  {
    "id": 16,
    "book": "New Testament",
    "name": "Gathering in Christ",
    "reference": "Ephesians 1:10",
    "passage": "In the dispensation of the fulness of times he might gather together in one all things in Christ.",
    "fullPassage":"10 That in the dispensation of the fulness of times he might gather together in one all things in Christ, both which are in heaven, and which are on earth; even in him:"    
  },
  {
    "id": 17,
    "book": "New Testament",
    "name": "Church Foundation",
    "reference": "Ephesians 2:19–20",
    "passage": "The Church is 'built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone.'",
    "fullPassage":"19 Now therefore ye are no more strangers and foreigners, but fellowcitizens with the saints, and of the household of God;   20 And are built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone;"
  },
  {
    "id": 18,
    "book": "New Testament",
    "name": "Falling Away",
    "reference": "2 Thessalonians 2:1–3",
    "passage": "The day of Christ … shall not come, except there come a falling away first.",
    "fullPassage":"1 Now we beseec you, brethren, by the coming of our Lord Jesus Christ, and by our gathering together unto him,    2 That ye be not soon shaken i mind, or be troubled, neither by spirit, nor by word, nor by letter as from us, as that the day of Christ is at hand.    3 Let no man deceive you by an means: for that day shall not come, except there come a falling away first, and that man of sin be revealed, the son of perdition;"    
  },
  {
    "id": 19,
    "book": "New Testament",
    "name": "Scriptures for Salvation",
    "reference": "2 Timothy 3:15–17",
    "passage": "The holy scriptures … are able to make thee wise unto salvation.",
    "fullPassage":"15 And that from a child thou hast known the holy scriptures, which are able to make thee wise unto salvation through faith which is in Christ Jesus.    16 All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:    17 That the man of God may be perfect, throughly furnished unto all good works."    
  },
  {
    "id": 20,
    "book": "New Testament",
    "name": "Father of Spirits",
    "reference": "Hebrews 12:9",
    "passage": "Heavenly Father is 'the Father of spirits.'",
    "fullPassage":"9 Furthermore we have had fathers of our flesh which corrected us, and we gave them reverence: shall we not much rather be in subjection unto the Father of spirits, and live?"
    
  },
  {
    "id": 21,
    "book": "New Testament",
    "name": "Ask for Wisdom",
    "reference": "James 1:5–6",
    "passage": "If any of you lack wisdom, let him ask of God.",
    "fullPassage":"5 If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.    6 But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed."    
  },
  {
    "id": 22,
    "book": "New Testament",
    "name": "Faith and Works",
    "reference": "James 2:17–18",
    "passage": "Faith, if it hath not works, is dead.",
    "fullPassage":"17 Even so faith, if it hath not works, is dead, being alone.    18 Yea, a man may say, Thou hast faith, and I have works: shew me thy faith without thy works, and I will shew thee my faith by my works."    
  },
  {
    "id": 23,
    "book": "New Testament",
    "name": "Gospel Preached to the Dead",
    "reference": "1 Peter 4:6",
    "passage": "The gospel [was] preached also to them that are dead.",
    "fullPassage":"6 For for this cause was the gospel preached also to them that are dead, that they might be judged according to men in the flesh, but live according to God in the spirit."
    
  },
  {
    "id": 24,
    "book": "New Testament",
    "name": "Judgment by Works",
    "reference": "Revelation 20:12",
    "passage": "And the dead were judged … according to their works.",
    "fullPassage":"12 And I saw the dead, small and great, stand before God; and the books were opened: and another book was opened, which is the book of life: and the dead were judged out of those things which were written in the books, according to their works."
  }],
  "Book of Mormon":[
    
    {
      "id": 25,
      "book": "Book of Mormon",
      "name": "Godhead",
      "reference": "2 Nephi 31:21",
      "passage": "The Father, the Son, and the Holy Ghost are one."
    }
  ]
}

